app/controllers/products_controller.rb

SELECT "products".* FROM "products" LIMIT ?  [["LIMIT", 8]]
---
    def index
      @products = Product.limit(8)

SELECT "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 8]]
---
    def load_more
      offset = params[:offset].to_i
      @products = Product.offset(offset).limit(8)

      respond_to do |format|
        format.json { render json: @products.map { |product| product_data(product) } }